# Seaborn

In [6]:
import seaborn as sns

In [7]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

In [8]:
tips = sns.load_dataset("tips")
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [9]:
tips.shape

(244, 7)

In [10]:
tips.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [11]:
tips[tips.sex=='Female'].shape

(87, 7)

In [12]:
tips[['total_bill','tip', 'size']]

     total_bill   tip  size
0         16.99  1.01     2
1         10.34  1.66     3
2         21.01  3.50     3
3         23.68  3.31     2
4         24.59  3.61     4
..          ...   ...   ...
239       29.03  5.92     3
240       27.18  2.00     2
241       22.67  2.00     2
242       17.82  1.75     2
243       18.78  3.00     2

[244 rows x 3 columns]

In [13]:
data=tips.head()

In [14]:
data.rename({'total_bill':'bill','size':'persons'}, axis=1) # not overwrite the original dataframe

    bill   tip     sex smoker  day    time  persons
0  16.99  1.01  Female     No  Sun  Dinner        2
1  10.34  1.66    Male     No  Sun  Dinner        3
2  21.01  3.50    Male     No  Sun  Dinner        3
3  23.68  3.31    Male     No  Sun  Dinner        2
4  24.59  3.61  Female     No  Sun  Dinner        4

In [15]:
data

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [16]:
data.reindex(["tip","day","name"], axis=1)

    tip  day  name
0  1.01  Sun   NaN
1  1.66  Sun   NaN
2  3.50  Sun   NaN
3  3.31  Sun   NaN
4  3.61  Sun   NaN

In [17]:
data[["tip","day"]]

    tip  day
0  1.01  Sun
1  1.66  Sun
2  3.50  Sun
3  3.31  Sun
4  3.61  Sun